---
kind: other
id: Methods.T:Autodesk.Revit.DB.Lighting.LineLightShape
source: html/94508a01-defd-0d6f-0199-f8cf5f4826be.htm
---
# LineLightShape Methods

Creates a copy of the LightShape derived object.